cmsis-svd/cmsis-svd/data/NXP/LPC11xx_v6a.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CANEC</name>
			<description>Error counter</description>
			<addressOffset>0x008</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TEC_7_0</name>
					<description>Transmit error counter Current value of the transmit error counter (maximum value 255)</description>
					<bitRange>[7:0]</bitRange>

				</field>
				<field>
					<name>REC_6_0</name>
					<description>Receive error counter Current value of the receive error counter (maximum value 127).</description>
					<bitRange>[14:8]</bitRange>

				</field>
				<field>
					<name>RP</name>
					<description>Receive error passive</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BELOWERRORPASSIVE</name>
							<description>The receive counter is below the error passive level.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ERRORPASSIVE</name>
							<description>The receive counter has reached the error passive level as defined in the  CAN2.0 specification.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>CANBT</name>
			<description>Bit timing register</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0x2301</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BRP</name>
					<description>Baud rate prescaler The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Baud Rate Prescaler are 0 to 63.[1]</description>
					<bitRange>[5:0]</bitRange>
				</field>
				<field>
					<name>SJW</name>
					<description>(Re)synchronization jump width Valid programmed values are 0 to 3.[1]</description>
					<bitRange>[7:6]</bitRange>
				</field>
				<field>
					<name>TSEG1</name>
					<description>Time segment before the sample point Valid values are 1 to 15.[1]</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>TSEG2</name>
					<description>Time segment after the sample point Valid values are 0 to 7.[1]</description>
					<bitRange>[14:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:15]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CANINT</name>
			<description>Interrupt register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-only</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>INTID</name>
					<description>0x0000 = No interrupt is pending. 0x0001 - 0x0020 = Number of message object which caused the interrupt. 0x0021 - 0x7FFF = Unused 0x8000 = Status interrupt 0x8001 - 0xFFFF = Unused</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CANTEST</name>
			<description>Test register</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[1:0]</bitRange>

				</field>
				<field>
					<name>BASIC</name>
					<description>Basic mode</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BASIC_MODE_DISABLED_</name>
							<description>Basic mode disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TXRX</name>
							<description>IF1 registers used as TX buffer, IF2 registers used as RX buffer.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SILENT</name>
					<description>Silent mode</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NORMAL_OPERATION_</name>
							<description>Normal operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SILENT</name>
							<description>The module is in silent mode.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>LBACK</name>
					<description>Loop back mode</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Loop back mode is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Loop back mode is enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TX</name>
					<description>Control of CAN_TXD pins</description>
					<bitRange>[6:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>LEVEL</name>
							<description>Level at the CAN_TXD pin is controlled by the CAN controller. This is the value at reset.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TXD</name>
							<description>The sample point can be monitored at the CAN_TXD pin.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>LOW</name>
							<description>CAN_TXD pin is driven LOW/dominant.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>HIGH</name>
							<description>CAN_TXD pin is driven HIGH/recessive.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RX</name>
					<description>Monitors the actual value of the CAN_RXD pin.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RECESSIVE</name>
							<description>The CAN bus is recessive (CAN_RXD = 1).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DORMANT</name>
							<description>The CAN bus is dominant (CAN_RXD = 0).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>R/W</description>
					<bitRange>[31:8]</bitRange>

