cmsis-svd/cmsis-svd/data/NXP/LPC11xx_v6a.svd
				</field>
			</fields>
		</register>
		<register>
			<name>CANBRPE</name>
			<description>Baud rate prescaler extension register</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BRPE</name>
					<description>Baud rate prescaler extension By programming BRPE the Baud Rate Prescaler can be extended to values up to 1023. Hardware interprets the value as the value of BRPE (MSBs) and BRP (LSBs) plus one. Allowed values are 0 to 15.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>CANIF%s_CMDREQ</name>
			<description>Message interface  command request</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0x0001</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MN</name>
					<description>Message number 0x01 - 0x20 = Valid message numbers. The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 - 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
					<bitRange>[5:0]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>reserved</description>
					<bitRange>[14:6]</bitRange>

				</field>
				<field>
					<name>BUSY</name>
					<description>BUSY flag</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ZERO</name>
							<description>Set to zero by hardware when read/write action to this Command request register has finished.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ONE</name>
							<description>Set to one by hardware when writing to this Command request register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>CANIF%s_CMDMSK_W</name>
			<description>Message interface 
command mask - write direction</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA_B</name>
					<description>Access data bytes 4-7</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DATA_BYTES_4_7_UNCHA</name>
							<description>Data bytes 4-7 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER_DATA_BYTES_</name>
							<description>Transfer data bytes 4-7 to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DATA_A</name>
					<description>Access data bytes 0-3</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DATA_BYTES_0_3_UNCHA</name>
							<description>Data bytes 0-3 unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER_DATA_BYTES_</name>
							<description>Transfer data bytes 0-3 to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>TXRQST</name>
					<description>Access transmission request bit</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_TRANSMISSION_REQU</name>
							<description>No transmission request. TXRQSRT bit unchanged in IF1/2_MCTRL. If a transmission is requested by programming this bit, the TXRQST bit in the CANIFn_MCTRL register is ignored.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REQUEST_A_TRANSMISSI</name>
							<description>Request a transmission. Set the TXRQST bit IF1/2_MCTRL.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CLRINTPND</name>
					<description>This bit is ignored in the write direction.</description>
					<bitRange>[3:3]</bitRange>

				</field>
				<field>
					<name>CTRL</name>
					<description>Access control bits</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Control bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER_CONTROL_BIT</name>
							<description>Transfer control bits to message object</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ARB</name>
					<description>Access arbitration bits</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Arbitration bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER_IDENTIFIER</name>
							<description>Transfer Identifier, DIR, XTD, and MSGVAL bits to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MASK</name>
					<description>Access mask bits</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>UNCHANGED</name>
							<description>Mask bits unchanged.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSFER_IDENTIFIER_</name>
							<description>Transfer Identifier MASK + MDIR + MXTD to message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>WR_RD</name>
					<description>Write transfer Transfer data from the selected message buffer registers to the message object addressed by the command request register CANIFn_CMDREQ.</description>
					<bitRange>[7:7]</bitRange>

