cmsis-svd/cmsis-svd/data/NXP/LPC11xx_v6a.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>CANIF%s_MSK2</name>
			<description>Message interface 1 mask 2</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0xFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MSK_28_16</name>
					<description>Identifier mask</description>
					<bitRange>[12:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOINHIBIT</name>
							<description>The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACCEPTANCEFILTERING</name>
							<description>The corresponding identifier bit is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[13:13]</bitRange>

				</field>
				<field>
					<name>MDIR</name>
					<description>Mask message direction</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOEFFECT</name>
							<description>The message direction bit (DIR) has no effect on acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACCEPTANCEFILTERING</name>
							<description>The message direction bit (DIR) is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MXTD</name>
					<description>Mask extend identifier</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NOEFFECT</name>
							<description>The extended identifier bit (XTD) has no effect on acceptance filtering.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACCEPTANCEFILTERING</name>
							<description>The extended identifier bit (XTD) is used for acceptance filtering.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>CANIF%s_ARB1</name>
			<description>Message interface 1 arbitration 1</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID_15_0</name>
					<description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>2</dim>
			<dimIncrement>0x60</dimIncrement>
			<dimIndex>1-2</dimIndex>
			<name>CANIF%s_ARB2</name>
			<description>Message interface 1 arbitration 2</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0x0000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID_28_16</name>
					<description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
					<bitRange>[12:0]</bitRange>

				</field>
				<field>
					<name>DIR</name>
					<description>Message direction</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RECEIVE</name>
							<description>Direction = receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>TRANSMIT</name>
							<description>Direction = transmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>XTD</name>
					<description>Extend identifier</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>11_BIT_STANDARD_</name>
							<description>The 11-bit standard identifier will be used for this message object.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>29_BIT_EXTENDED_</name>
							<description>The 29-bit extended identifier will be used for this message object.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>MSGVAL</name>
					<description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required.</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>IGNORE</name>
							<description>The message object is ignored by the message handler.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CONFIGURED</name>
							<description>The message object is configured and should be considered by the message handler.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:16]</bitRange>

